
#Область ПрограммныйИнтерфейс

Процедура ВКМ_ТГУведомление() Экспорт

	HTTPСоединение = Новый HTTPСоединение("api.telegram.org", 443, , , , , Новый ЗащищенноеСоединениеOpenSSL);

	ДанныеДляЗапроса = "bot" + Константы.ВКМ_ТокенТелеграммБота.Получить() + "/sendMessage";
	HTTPЗапрос = Новый HTTPЗапрос(ДанныеДляЗапроса);

	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_УведомленияБоту.Ссылка,
	|	ВКМ_УведомленияБоту.ТекстСообщения
	|ИЗ
	|	Справочник.ВКМ_УведомленияБоту КАК ВКМ_УведомленияБоту";
	
	Результат = Запрос.Выполнить().Выбрать();

	Пока Результат.Следующий() Цикл

		Сообщение = Новый Структура;
		Сообщение.Вставить("chat_id", Константы.ВКМ_ИдентификаторГруппыТелеграм.Получить());
		Сообщение.Вставить("text", Результат.ТекстСообщения);

		СтрокаJSON = СтрокаJSON(Сообщение);

		HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаJSON);

		HTTPОтвет = HTTPСоединение.Получить(HTTPЗапрос);

		Если HTTPОтвет.КодСостояния = 200 Тогда
			ДокОбъект = Результат.Ссылка.ПолучитьОбъект();
			ДокОбъект.Удалить();
		Иначе
			ИиформацияОбОшибке = ИнформацияОбОшибке();

			ЗаписьЖурналаРегистрации("HTTPСервисы.Ошибка", УровеньЖурналаРегистрации.Ошибка, , ,
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИиформацияОбОшибке));

		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция СтрокаJSON(ОбъектJSON)

	ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(, Символы.Таб);

	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку(ПараметрыЗаписи);
	ЗаписатьJSON(Запись, ОбъектJSON);

	Возврат Запись.Закрыть();

КонецФункции

#КонецОбласти
