
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	ВКМ_СформироватьДвиженияДополнительныеНачиления();

	ВКМ_СформироватьДвиженияУдержания();

	ВКМ_ДвиженияВзаиморасчетыССотрудниками();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВКМ_СформироватьДвиженияДополнительныеНачиления()

	Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;

	Для Каждого Строка Из НачисленияПремий Цикл

		Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
		Движение.ПериодРегистрации = Дата;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ФиксированнаяПремия;
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.БазовыйПериодНачало = НачалоМесяца(Дата);
		Движение.БазовыйПериодКонец = КонецМесяца(Дата);
		Движение.Результат = Строка.СуммаПремии;

	КонецЦикла;

	Движения.ВКМ_ДополнительныеНачисления.Записать();
КонецПроцедуры

Процедура ВКМ_СформироватьДвиженияУдержания();	
	
	Движения.ВКМ_Удержания.Записывать = Истина;

	Для Каждого Строка Из НачисленияПремий Цикл

		Движение = Движения.ВКМ_Удержания.Добавить();
		Движение.ПериодРегистрации = Дата;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.БазовыйПериодНачало = НачалоМесяца(Дата);
		Движение.БазовыйПериодКонец = КонецМесяца(Дата);
		Движение.Результат = Строка.СуммаПремии * 13 / 100;

	КонецЦикла;

	Движения.ВКМ_Удержания.Записать();
КонецПроцедуры

Процедура ВКМ_ДвиженияВзаиморасчетыССотрудниками() 
	
	// регистр ВзаиморасчетыССотрудниками
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				|	ВКМ_НачислениеФиксПремийНачисленияПремий.Сотрудник КАК Сотрудник,
				|	СУММА(ВКМ_НачислениеФиксПремийНачисленияПремий.СуммаПремии) КАК СуммаПремии
				|ИЗ
				|	Документ.ВКМ_НачислениеФиксПремий.НачисленияПремий КАК ВКМ_НачислениеФиксПремийНачисленияПремий
				|ГДЕ
				|	ВКМ_НачислениеФиксПремийНачисленияПремий.Ссылка = &Ссылка
				|СГРУППИРОВАТЬ ПО
				|	ВКМ_НачислениеФиксПремийНачисленияПремий.Сотрудник";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	РезультатЗапроса = Запрос.Выполнить().Выбрать();

	Пока РезультатЗапроса.Следующий() Цикл

		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Сотрудник = РезультатЗапроса.Сотрудник;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ФиксированнаяПремия;
		СуммаУдержания = РезультатЗапроса.СуммаПремии * 13 / 100;
		Движение.Сумма = РезультатЗапроса.СуммаПремии - СуммаУдержания;

	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
