
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ЗаполнитьГрафик(Команда)
	ВыполнитьОбработку();
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Обработка завершена!";
	Сообщение.Сообщить();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВыполнитьОбработку()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗаполнитьГрафик(Период.ДатаНачала, Период.ДатаОкончания, Выходные);
КонецПроцедуры

#КонецОбласти
