

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗаполнитьНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник КАК Сотрудник,
				|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.ВидРасчета КАК ВидРасчета,
				|	СУММА(ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток) КАК СуммаОстаток
				|ИЗ
				|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&Период,) КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки
				|СГРУППИРОВАТЬ ПО
				|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник,
				|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.ВидРасчета";

	Период = Новый Граница(Объект.Дата, ВидГраницы.Включая);
	Запрос.УстановитьПараметр("Период", Период);
	Результат = Запрос.Выполнить().Выбрать();

	Объект.Выплаты.Очистить();

	Пока Результат.Следующий() Цикл

		Строка = Объект.Выплаты.Добавить();
		Строка.Сотрудник = Результат.Сотрудник;
		Строка.ВидРасчета = Результат.ВидРасчета;
		Строка.Сумма = Результат.СуммаОстаток;

	КонецЦикла;

КонецПроцедуры
#КонецОбласти

